Revit 2027 API
ParameterMap.Contains Method
Tests for the existence of a key within the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	string key
)
Public Overridable Function Contains (
	key As String
) As Boolean
public:
virtual bool Contains(
	String^ key
)
abstract Contains :
        key : string -> bool
override Contains :
        key : string -> bool
Parameters
key String
The key to be searched for.
Return Value
Boolean
The Contains method returns True if the key is within the map, otherwise False.
See Also
Reference
ParameterMap Class
Autodesk.Revit.DB Namespace